In [1]:
import pandas as pd

In [2]:
person = {
    "first":["Corey"],
    "last":["Andison"],
    "email":["Corey@gmail.com"]
}

In [3]:
my_dict = {
    "name": "John",
    "age": 30,
    "city": "New York"
}

In [4]:
student_info = {
    "student_id": "S12345",
    "grade": "A",
    "subjects": ["Math", "Science", "English"]
}

In [7]:
student_info['subjects']

['Math', 'Science', 'English']

In [9]:
df = pd.DataFrame(student_info)

In [10]:
df

  student_id grade subjects
0     S12345     A     Math
1     S12345     A  Science
2     S12345     A  English

In [13]:
df['subjects']

0       Math
1    Science
2    English
Name: subjects, dtype: object

In [14]:
type(df['subjects'])

pandas.core.series.Series

In [16]:
df.subjects

0       Math
1    Science
2    English
Name: subjects, dtype: object

In [17]:
df[['student_id','grade']]

  student_id grade
0     S12345     A
1     S12345     A
2     S12345     A

In [19]:
df.columns

Index(['student_id', 'grade', 'subjects'], dtype='object')

In [22]:
df.iloc[[0,1],2]

0       Math
1    Science
Name: subjects, dtype: object

In [23]:
df

  student_id grade subjects
0     S12345     A     Math
1     S12345     A  Science
2     S12345     A  English

In [29]:
df.loc[[0,1], ['student_id', 'subjects']]

  student_id subjects
0     S12345     Math
1     S12345  Science